/*

主页	讨论版	问题	名次	状态	统计
！！请使用学号注册用户名！！
问题 T: 数据排序（函数模板）

时间限制: 1 Sec  内存限制: 128 MB
提交: 123  解决: 64
[提交][状态][讨论版]
题目描述

编写一个进行升序排序的函数模板，其中数组为具有n个元素，类型为T。

注意：必须使用模板函数

输入

第一行输入t表示有t个测试实例

第二行先输入一个大写字母表示数组类型，I表示整数类型，C表示字符型，S表示字符串型，D表示双精度数类型；然后输入n表示数组长度。

第三行输入n个数据

依次输入t个实例

输出

每行输出一个结果

样例输入

4
I 10
15 3 51 27 9 35 78 14 65 8
D 3
-11.3 25.42 13.2
C 6
a b g e u q
S 4
sandy david eason cindy
样例输出

3 8 9 14 15 27 35 51 65 78
-11.3 13.2 25.42
a b e g q u
cindy david eason sandy
提示

[提交][状态][讨论版]
中文  English
All Copyright Reserved 2010-2011 深圳大学在线判题教学平台 TEAM*/